// Сложный функциональный тип
// () -> () -> Void // Читаем слева направо. ФУнкция, возвращает функцию, возвращающая Void(ничего)
// (Int) -> (String) -> Bool // Функция принимает значение Int и возвращает
                             // Функцию принимающую String, которая возвращает Bool.
                             // ЛОгика слева - направо.
                             // Философия?

// (Int, (Int) -> Void) -> Bool
// Функция принимающая Int и Функцию(которая принимает Int и возвращает Void) и возвращает Bool
